#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ayur/snowflake-demo/runs/run-JFdeej7qiKohavM5

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...
snowflake_role.dev_role: Refreshing state... [id=DEV_ROLE]
snowflake_grant_account_role.grants: Refreshing state... [id="DEV_ROLE"|USER|"VISEO"]
snowflake_database.dev_db: Refreshing state... [id=DEV_DB]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnAccountObject|DATABASE|"DEV_DB"]
snowflake_schema.business_dtv: Refreshing state... [id="DEV_DB"."BUSINESS_DTV"]
snowflake_schema.info_delivery: Refreshing state... [id="DEV_DB"."INFO_DELIVERY"]
snowflake_schema.raw_dtv: Refreshing state... [id="DEV_DB"."RAW_DTV"]
snowflake_schema.staging: Refreshing state... [id="DEV_DB"."STAGING"]
snowflake_grant_privileges_to_account_role.schema_grant2: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnSchema|OnSchema|"DEV_DB"."BUSINESS_DTV"]
snowflake_grant_privileges_to_account_role.schema_grant1: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnSchema|OnSchema|"DEV_DB"."RAW_DTV"]
snowflake_grant_privileges_to_account_role.schema_grant3: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnSchema|OnSchema|"DEV_DB"."INFO_DELIVERY"]
snowflake_grant_privileges_to_account_role.schema_grant: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnSchema|OnSchema|"DEV_DB"."STAGING"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_grant_privileges_to_account_role.tables_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "tables_grant" {
      + account_role_name = "DEV_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "INSERT",
          + "SELECT",
        ]
      + with_grant_option = false

      + on_schema_object {
          + future {
              + in_database        = "DEV_DB"
              + object_type_plural = "TABLES"
            }
        }
    }

  # snowflake_warehouse.warehouse will be created
  + resource "snowflake_warehouse" "warehouse" {
      + auto_resume                         = "default"
      + auto_suspend                        = 60
      + enable_query_acceleration           = "default"
      + fully_qualified_name                = (known after apply)
      + id                                  = (known after apply)
      + max_concurrency_level               = (known after apply)
      + name                                = "DEV_WH"
      + parameters                          = (known after apply)
      + query_acceleration_max_scale_factor = -1
      + show_output                         = (known after apply)
      + statement_queued_timeout_in_seconds = (known after apply)
      + statement_timeout_in_seconds        = (known after apply)
      + warehouse_size                      = "xsmall"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_ACCOUNT" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-JFdeej7qiKohavM5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_USER" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-JFdeej7qiKohavM5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"].security_admin,
│   on providers.tf line 1, in provider "snowflake":
│    1: provider "snowflake" {
│ 
│ Specify the region as part of the account parameter
│ 
│ (and 3 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with snowflake_role.dev_role,
│   on roles.tf line 1, in resource "snowflake_role" "dev_role":
│    1: resource "snowflake_role" "dev_role" {
│ 
│ This resource is deprecated and will be removed in a future major version
│ release. Please use snowflake_account_role instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pusher: @yassinedehbi, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Workflow`*